In [ ]:
# Groupby
"""
A groupby operation involves some combination of splitting the object, 
applying a function, and combining the results. 
This can be used to group large amounts of data and compute operations on these groups.
"""

In [1]:
#Splitting or Aggregations or Fiteration or Transformation
import pandas as pd

In [2]:
ipl_data = {'Team': ['MI', 'MI', 'Devils', 'Devils', 'Kings',
   'CSK', 'CSK', 'CSK', 'MI', 'Royals', 'Royals', 'MI'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [3]:
#i want the unique Team Names/find out total teams in dataset
# which teams are present
df['Team'].unique()

array(['MI', 'Devils', 'Kings', 'CSK', 'Royals'], dtype=object)

In [5]:
# How many total teams we have???
df.Team.nunique()

5

In [4]:
#find out the total count (teamwise)
df['Team'].value_counts()

MI        4
CSK       3
Devils    2
Royals    2
Kings     1
Name: Team, dtype: int64

In [6]:
#Group DataFrame using a mapper or by a Series of columns.
df.groupby('Team') #groupby on Team column

In [7]:
list(df.groupby('Team'))

[('CSK',
    Team  Rank  Year  Points
  5  CSK     4  2015     812
  6  CSK     1  2016     756
  7  CSK     1  2017     788),
 ('Devils',
       Team  Rank  Year  Points
  2  Devils     2  2014     863
  3  Devils     3  2015     673),
 ('Kings',
      Team  Rank  Year  Points
  4  Kings     3  2014     741),
 ('MI',
     Team  Rank  Year  Points
  0    MI     1  2014     876
  1    MI     2  2015     789
  8    MI     2  2016     694
  11   MI     2  2017     690),
 ('Royals',
        Team  Rank  Year  Points
  9   Royals     4  2014     701
  10  Royals     1  2015     804)]

In [8]:
for i in df.groupby('Team'):
    print(i)
    print('\n')

('CSK',   Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788)


('Devils',      Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673)


('Kings',     Team  Rank  Year  Points
4  Kings     3  2014     741)


('MI',    Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690)


('Royals',       Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804)

In [9]:
#if i want only team from a tuple
for i in df.groupby('Team'):
    print(i[0])
    print('\n')

CSK


Devils


Kings


MI


Royals

In [10]:
#if i want only dataFrame of team from a tuple
for i in df.groupby('Team'):
    print(i[1])
    print('\n')

  Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788


     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673


    Team  Rank  Year  Points
4  Kings     3  2014     741


   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690


      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [13]:
#if i want only team/only data of each team from a tuple: Unpacking of a tuple
for team,data in df.groupby('Team'):
    #print(team)
    print(data)
    print('\n')

  Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788


     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673


    Team  Rank  Year  Points
4  Kings     3  2014     741


   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690


      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [14]:
#fetch data of only MI
for team,data in df.groupby('Team'):
    if team=='MI':
        print(data)

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [17]:
# without groupby normal solutions:fetch data of only MI
df[df.Team=='MI']

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [20]:
#to get same answer use query
df.query('Team=="MI"')

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [21]:
df.groupby('Team').get_group('MI')

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [35]:
df.groupby('Team').groups
#it gives team name : index(where it is present)

{'CSK': [5, 6, 7], 'Devils': [2, 3], 'Kings': [4], 'MI': [0, 1, 8, 11], 'Royals': [9, 10]}

In [31]:
df.loc[[0,1,8,11]]

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [23]:
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [36]:
df.groupby('Year').mean()

      Rank  Points
Year
2014   2.5  795.25
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  739.00

In [39]:
df.groupby('Year').mean()['Points']

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [40]:
#take sum of all points yearwise
df.groupby('Year').sum()['Points']

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [41]:
df.groupby('Rank').groups #Total teams 5

{1: [0, 6, 7, 10], 2: [1, 2, 8, 11], 3: [3, 4], 4: [5, 9]}

In [42]:
list(df.groupby('Rank'))

[(1,
        Team  Rank  Year  Points
  0       MI     1  2014     876
  6      CSK     1  2016     756
  7      CSK     1  2017     788
  10  Royals     1  2015     804),
 (2,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  2   Devils     2  2014     863
  8       MI     2  2016     694
  11      MI     2  2017     690),
 (3,
       Team  Rank  Year  Points
  3  Devils     3  2015     673
  4   Kings     3  2014     741),
 (4,
       Team  Rank  Year  Points
  5     CSK     4  2015     812
  9  Royals     4  2014     701)]

In [43]:
#fetch only teams with rank 1
df.groupby('Rank').get_group(1)

      Team  Rank  Year  Points
0       MI     1  2014     876
6      CSK     1  2016     756
7      CSK     1  2017     788
10  Royals     1  2015     804

In [44]:
#fetch 1st entry of each category(rank) according to Team with Rank groupby
df.groupby('Rank').first() #last()

        Team  Year  Points
Rank
1         MI  2014     876
2         MI  2015     789
3     Devils  2015     673
4        CSK  2015     812

In [45]:
list(df.groupby('Rank'))

[(1,
        Team  Rank  Year  Points
  0       MI     1  2014     876
  6      CSK     1  2016     756
  7      CSK     1  2017     788
  10  Royals     1  2015     804),
 (2,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  2   Devils     2  2014     863
  8       MI     2  2016     694
  11      MI     2  2017     690),
 (3,
       Team  Rank  Year  Points
  3  Devils     3  2015     673
  4   Kings     3  2014     741),
 (4,
       Team  Rank  Year  Points
  5     CSK     4  2015     812
  9  Royals     4  2014     701)]

In [46]:
#Multiple column groupby
df.groupby(['Team','Year']).groups

{('CSK', 2015): [5], ('CSK', 2016): [6], ('CSK', 2017): [7], ('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('MI', 2014): [0], ('MI', 2015): [1], ('MI', 2016): [8], ('MI', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10]}

In [47]:
list(df.groupby(['Team','Year']))

[(('CSK', 2015),
    Team  Rank  Year  Points
  5  CSK     4  2015     812),
 (('CSK', 2016),
    Team  Rank  Year  Points
  6  CSK     1  2016     756),
 (('CSK', 2017),
    Team  Rank  Year  Points
  7  CSK     1  2017     788),
 (('Devils', 2014),
       Team  Rank  Year  Points
  2  Devils     2  2014     863),
 (('Devils', 2015),
       Team  Rank  Year  Points
  3  Devils     3  2015     673),
 (('Kings', 2014),
      Team  Rank  Year  Points
  4  Kings     3  2014     741),
 (('MI', 2014),
    Team  Rank  Year  Points
  0   MI     1  2014     876),
 (('MI', 2015),
    Team  Rank  Year  Points
  1   MI     2  2015     789),
 (('MI', 2016),
    Team  Rank  Year  Points
  8   MI     2  2016     694),
 (('MI', 2017),
     Team  Rank  Year  Points
  11   MI     2  2017     690),
 (('Royals', 2014),
       Team  Rank  Year  Points
  9  Royals     4  2014     701),
 (('Royals', 2015),
        Team  Rank  Year  Points
  10  Royals     1  2015     804)]

In [57]:
list(df.groupby('Year')['Team'])

[(2014,
  0        MI
  2    Devils
  4     Kings
  9    Royals
  Name: Team, dtype: object),
 (2015,
  1         MI
  3     Devils
  5        CSK
  10    Royals
  Name: Team, dtype: object),
 (2016,
  6    CSK
  8     MI
  Name: Team, dtype: object),
 (2017,
  7     CSK
  11     MI
  Name: Team, dtype: object)]

# Iterations over Group

In [ ]:
#Iterating through groups
#Problem statement: Identify yearwise records  from whole dataset
grouped = df.groupby('Year')
for v in grouped:
    print(v)
    print('\n')

In [ ]:
grouped = df.groupby('Year')
for v in grouped:
    print(v[0])

In [ ]:
grouped = df.groupby('Year')
for v in grouped:
    if v[0]==2017:
        print(v[1])

In [ ]:
grouped = df.groupby('Year')
list(grouped)[:][0][1][1:-1]

In [ ]:
#fetch record of 2015 without using groupby
df[df['Year']==2015]

In [ ]:
df.query('Year==2015')

In [ ]:
df[df.loc[:,'Year']==2015]

In [ ]:
grouped = df.groupby('Year')
grouped.get_group(2015)

In [ ]:
#Selecting a perticular group
grouped = df.groupby('Team')
grouped.get_group('MI')

In [59]:
#wantto fetch the data of year =2014
list(df.groupby('Year'))[0]

(2014,
      Team  Rank  Year  Points
 0      MI     1  2014     876
 2  Devils     2  2014     863
 4   Kings     3  2014     741
 9  Royals     4  2014     701)

In [ ]:
#i want record of year 2017
df.groupby('Year').get_group(2017)

In [ ]:
# i want the team who stood 1st max times in ipl
df.groupby('Rank').get_group(1)

In [ ]:
df.groupby('Rank').get_group(1)['Team'].value_counts()

In [60]:
#Aggregations #sum mean median mode std
#Aggregations work only on Numeric fields
import numpy as np

grouped = df.groupby('Year')
grouped['Points']

In [63]:
list(df.groupby('Year')['Points'])

[(2014,
  0    876
  2    863
  4    741
  9    701
  Name: Points, dtype: int64),
 (2015,
  1     789
  3     673
  5     812
  10    804
  Name: Points, dtype: int64),
 (2016,
  6    756
  8    694
  Name: Points, dtype: int64),
 (2017,
  7     788
  11    690
  Name: Points, dtype: int64)]

In [68]:
grouped = df.groupby('Year')
grouped['Points'].agg(np.sum) # or use python sum function

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [69]:
grouped = df.groupby('Team')
grouped.agg(np.size) #here size is nothing but occurance

        Rank  Year  Points
Team
CSK        3     3       3
Devils     2     2       2
Kings      1     1       1
MI         4     4       4
Royals     2     2       2

In [70]:
df.Team.value_counts()

MI        4
CSK       3
Devils    2
Royals    2
Kings     1
Name: Team, dtype: int64

In [71]:
#Applying Multiple Aggregation Functions at Once
grouped = df.groupby('Team')
grouped['Points'].agg([np.sum, np.mean, np.std,min,max])

         sum        mean         std  min  max
Team
CSK     2356  785.333333   28.095077  756  812
Devils  1536  768.000000  134.350288  673  863
Kings    741  741.000000         NaN  741  741
MI      3049  762.250000   88.567771  690  876
Royals  1505  752.500000   72.831998  701  804

## Transformation

In [72]:
#Transformation calling a function over the selected data
grouped = df.groupby('Team')
# write a function to add +500 points to each team
score = lambda x: (x + 500)
grouped['Points'].transform(score)

0     1376
1     1289
2     1363
3     1173
4     1241
5     1312
6     1256
7     1288
8     1194
9     1201
10    1304
11    1190
Name: Points, dtype: int64

In [74]:
df.Points.map(lambda x: x+500)

0     1376
1     1289
2     1363
3     1173
4     1241
5     1312
6     1256
7     1288
8     1194
9     1201
10    1304
11    1190
Name: Points, dtype: int64

In [76]:
df.Points+500

0     1376
1     1289
2     1363
3     1173
4     1241
5     1312
6     1256
7     1288
8     1194
9     1201
10    1304
11    1190
Name: Points, dtype: int64

In [77]:
#list(df.groupby('Team')['Points'])
df.groupby('Team')['Points'].transform(lambda x:x+100)

0     976
1     889
2     963
3     773
4     841
5     912
6     856
7     888
8     794
9     801
10    904
11    790
Name: Points, dtype: int64

In [ ]:
list(df.groupby('Team')['Rank'])

In [ ]:
# I want to give the +10 exxtra points to csk use transform
# I want to give extra +10 point only to the teams from year 2015